// See https://aka.ms/new-console-template for more information

/*
Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
6, 1, 33 -> [6, 1, 33]*/

int[] a = {3,5,2,6,9,10,12,16,0};

foreach (int i in a)
{
    System.Console.WriteLine(i);
}


